JuhoL/UTest_Example/Sources/CMSIS/mocks/stm32f429xx_mock.h
/** 
  * @brief USB_OTG_OUT_Endpoint-Specific_Registers
  */
typedef struct 
{
    uint32_t DOEPCTL;       /*!< dev OUT Endpoint Control Reg           B00h + (ep_num * 20h) + 00h */
  uint32_t Reserved04;         /*!< Reserved                               B00h + (ep_num * 20h) + 04h */
    uint32_t DOEPINT;       /*!< dev OUT Endpoint Itr Reg               B00h + (ep_num * 20h) + 08h */
  uint32_t Reserved0C;         /*!< Reserved                               B00h + (ep_num * 20h) + 0Ch */
    uint32_t DOEPTSIZ;      /*!< dev OUT Endpoint Txfer Size            B00h + (ep_num * 20h) + 10h */
    uint32_t DOEPDMA;       /*!< dev OUT Endpoint DMA Address           B00h + (ep_num * 20h) + 14h */
  uint32_t Reserved18[2];      /*!< Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} USB_OTG_OUTEndpointTypeDef;

/** 
  * @brief USB_OTG_Host_Mode_Register_Structures
  */
typedef struct 
{
    uint32_t HCFG;             /*!< Host Configuration Register          400h */
    uint32_t HFIR;             /*!< Host Frame Interval Register         404h */
    uint32_t HFNUM;            /*!< Host Frame Nbr/Frame Remaining       408h */
  uint32_t Reserved40C;           /*!< Reserved                             40Ch */
    uint32_t HPTXSTS;          /*!< Host Periodic Tx FIFO/ Queue Status  410h */
    uint32_t HAINT;            /*!< Host All Channels Interrupt Register 414h */
    uint32_t HAINTMSK;         /*!< Host All Channels Interrupt Mask     418h */
} USB_OTG_HostTypeDef;

/** 
  * @brief USB_OTG_Host_Channel_Specific_Registers
  */
typedef struct
{
    uint32_t HCCHAR;           /*!< Host Channel Characteristics Register    500h */
    uint32_t HCSPLT;           /*!< Host Channel Split Control Register      504h */
    uint32_t HCINT;            /*!< Host Channel Interrupt Register          508h */
    uint32_t HCINTMSK;         /*!< Host Channel Interrupt Mask Register     50Ch */
    uint32_t HCTSIZ;           /*!< Host Channel Transfer Size Register      510h */
    uint32_t HCDMA;            /*!< Host Channel DMA Address Register        514h */
  uint32_t Reserved[2];           /*!< Reserved                                      */
} USB_OTG_HostChannelTypeDef;

#define HAL_TIMERS_MAX        14
#define HAL_SPIS_MAX          9
#define HAL_USARTS_MAX        8
#define HAL_I2CS_MAX          3
#define HAL_CANS_MAX          2
#define HAL_ADCS_MAX          3
#define HAL_SAIS_MAX          2
#define HAL_LTDC_LAYERS_MAX   2
#define HAL_GPIOS_MAX         11
#define HAL_DMAS_MAX          2
#define HAL_DMA_STREAMS_MAX   16
#define HAL_USBS_MAX          2

extern TIM_TypeDef timers[HAL_TIMERS_MAX];
extern RTC_TypeDef rtc;
extern WWDG_TypeDef wwdg;
extern IWDG_TypeDef iwdg;
extern SPI_TypeDef spis[HAL_SPIS_MAX];
extern USART_TypeDef usarts[HAL_USARTS_MAX];
extern I2C_TypeDef i2cs[HAL_I2CS_MAX];
extern CAN_TypeDef cans[HAL_CANS_MAX];
extern PWR_TypeDef pwr;
extern DAC_TypeDef dac;
extern ADC_TypeDef adcs[HAL_ADCS_MAX];
extern ADC_Common_TypeDef adcCommon;
extern SDIO_TypeDef sdio;
extern SYSCFG_TypeDef sysCfg;
extern EXTI_TypeDef exti;
extern SAI_Block_TypeDef sais[HAL_SAIS_MAX];
extern LTDC_TypeDef ltdc;
extern LTDC_Layer_TypeDef ltdcLayers[HAL_LTDC_LAYERS_MAX];
extern GPIO_TypeDef gpios[HAL_GPIOS_MAX];
extern CRC_TypeDef crc;
extern RCC_TypeDef rcc;
extern FLASH_TypeDef flash;
extern DMA_TypeDef dmas[HAL_DMAS_MAX];
extern DMA_Stream_TypeDef dmaStreams[HAL_DMA_STREAMS_MAX];
extern ETH_TypeDef eth;
extern DMA2D_TypeDef dma2d;
extern DCMI_TypeDef dcmi;
extern RNG_TypeDef rng;
extern FMC_Bank1_TypeDef fmcBank1;
extern FMC_Bank1E_TypeDef fmcBank1E;
extern FMC_Bank2_3_TypeDef fmcBank2_3;
extern FMC_Bank4_TypeDef fmcBank4;
extern FMC_Bank5_6_TypeDef fmcBank5_6;
extern DBGMCU_TypeDef dbgMcu;
extern USB_OTG_GlobalTypeDef usbs[HAL_USBS_MAX];

/** @addtogroup Peripheral_declaration
  * @{
  */  
#define TIM2                (&timers[1])
#define TIM3                (&timers[2])
#define TIM4                (&timers[3])
#define TIM5                (&timers[4])
#define TIM6                (&timers[5])
#define TIM7                (&timers[6])
#define TIM12               (&timers[11])
#define TIM13               (&timers[12])
#define TIM14               (&timers[13])
#define RTC                 (&rtc)
#define WWDG                (&wwdg)
#define IWDG                (&iwdg)
#define I2S2ext             (&spis[7])
#define SPI2                (&spis[1])
#define SPI3                (&spis[2])
#define I2S3ext             (&spis[8])
#define USART2              (&usarts[1])
#define USART3              (&usarts[2])
#define UART4               (&usarts[3])
#define UART5               (&usarts[4])
#define I2C1                (&i2cs[0])
#define I2C2                (&i2cs[1])
#define I2C3                (&i2cs[2])
#define CAN1                (&cans[0])
#define CAN2                (&cans[1])
#define PWR                 (&pwr)
#define DAC1                (&dac)
#define DAC                 (DAC1)
#define UART7               (&usarts[6])
#define UART8               (&usarts[7])
#define TIM1                (&timers[0])
#define TIM8                (&timers[7])
#define USART1              (&usarts[0])
#define USART6              (&usarts[5])
#define ADC1                (&adcs[0])
#define ADC2                (&adcs[1])
#define ADC3                (&adcs[2])
#define ADC123_COMMON       (&adcCommon)
/* Legacy define */
#define ADC                 (ADC123_COMMON)
#define SDIO                (&sdio)
#define SPI1                (&spis[0])
#define SPI4                (&spis[3])
#define SYSCFG              (&sysCfg)
#define EXTI                (&exti)
#define TIM9                (&timers[8])
#define TIM10               (&timers[9])
#define TIM11               (&timers[10])
#define SPI5                (&spis[4])
#define SPI6                (&spis[5])
#define SAI1                (&spis[6])
#define SAI1_Block_A        (&sais[0])
#define SAI1_Block_B        (&sais[1])
#define LTDC                (&ltdc)
#define LTDC_Layer1         (&ltdcLayers[0])
#define LTDC_Layer2         (&ltdcLayers[1])
#define GPIOA               (&gpios[0])
#define GPIOB               (&gpios[1])
#define GPIOC               (&gpios[2])
#define GPIOD               (&gpios[3])
#define GPIOE               (&gpios[4])
#define GPIOF               (&gpios[5])
#define GPIOG               (&gpios[6])
#define GPIOH               (&gpios[7])
#define GPIOI               (&gpios[8])
#define GPIOJ               (&gpios[9])
#define GPIOK               (&gpios[10])
#define CRC                 (&crc)
#define RCC                 (&rcc)
#define FLASH               (&flash)
#define DMA1                (&dmas[0])
#define DMA1_Stream0        (&dmaStreams[0])
#define DMA1_Stream1        (&dmaStreams[1])
#define DMA1_Stream2        (&dmaStreams[2])
#define DMA1_Stream3        (&dmaStreams[3])
#define DMA1_Stream4        (&dmaStreams[4])
#define DMA1_Stream5        (&dmaStreams[5])
#define DMA1_Stream6        (&dmaStreams[6])
#define DMA1_Stream7        (&dmaStreams[7])
#define DMA2                (&dmas[1])
#define DMA2_Stream0        (&dmaStreams[8])
#define DMA2_Stream1        (&dmaStreams[9])
#define DMA2_Stream2        (&dmaStreams[10])
#define DMA2_Stream3        (&dmaStreams[11])
#define DMA2_Stream4        (&dmaStreams[12])
#define DMA2_Stream5        (&dmaStreams[13])
#define DMA2_Stream6        (&dmaStreams[14])
#define DMA2_Stream7        (&dmaStreams[15])
#define ETH                 (&eth)
#define DMA2D               (&dma2d)
#define DCMI                (&dcmi)
#define RNG                 (&rng)
#define FMC_Bank1           (&fmcBank1)
#define FMC_Bank1E          (&fmcBank1E)
#define FMC_Bank2_3         (&fmcBank2_3)
#define FMC_Bank4           (&fmcBank4)
#define FMC_Bank5_6         (&fmcBank5_6)
#define DBGMCU              (&dbgMcu)
#define USB_OTG_FS          (&usbs[0])
#define USB_OTG_HS          (&usbs[1])

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */
  
  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */
    
/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/
/*
 * @brief Specific device feature definitions (not present on all devices in the STM32F4 serie)
 */
#define ADC_MULTIMODE_SUPPORT                                                  /*!<ADC Multimode feature available on specific devices */

/********************  Bit definition for ADC_SR register  ********************/
#define ADC_SR_AWD_Pos            (0U)                                         
#define ADC_SR_AWD_Msk            (0x1UL << ADC_SR_AWD_Pos)                     /*!< 0x00000001 */
#define ADC_SR_AWD                ADC_SR_AWD_Msk                               /*!<Analog watchdog flag */
#define ADC_SR_EOC_Pos            (1U)                                         
#define ADC_SR_EOC_Msk            (0x1UL << ADC_SR_EOC_Pos)                     /*!< 0x00000002 */
#define ADC_SR_EOC                ADC_SR_EOC_Msk                               /*!<End of conversion */
#define ADC_SR_JEOC_Pos           (2U)                                         
#define ADC_SR_JEOC_Msk           (0x1UL << ADC_SR_JEOC_Pos)                    /*!< 0x00000004 */
#define ADC_SR_JEOC               ADC_SR_JEOC_Msk                              /*!<Injected channel end of conversion */
#define ADC_SR_JSTRT_Pos          (3U)                                         
#define ADC_SR_JSTRT_Msk          (0x1UL << ADC_SR_JSTRT_Pos)                   /*!< 0x00000008 */
#define ADC_SR_JSTRT              ADC_SR_JSTRT_Msk                             /*!<Injected channel Start flag */
#define ADC_SR_STRT_Pos           (4U)                                         
#define ADC_SR_STRT_Msk           (0x1UL << ADC_SR_STRT_Pos)                    /*!< 0x00000010 */
#define ADC_SR_STRT               ADC_SR_STRT_Msk                              /*!<Regular channel Start flag */
#define ADC_SR_OVR_Pos            (5U)                                         
#define ADC_SR_OVR_Msk            (0x1UL << ADC_SR_OVR_Pos)                     /*!< 0x00000020 */
#define ADC_SR_OVR                ADC_SR_OVR_Msk                               /*!<Overrun flag */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define ADC_CR1_AWDCH_Pos         (0U)                                         
#define ADC_CR1_AWDCH_Msk         (0x1FUL << ADC_CR1_AWDCH_Pos)                 /*!< 0x0000001F */
#define ADC_CR1_AWDCH             ADC_CR1_AWDCH_Msk                            /*!<AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define ADC_CR1_AWDCH_0           (0x01UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000001 */
#define ADC_CR1_AWDCH_1           (0x02UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000002 */
#define ADC_CR1_AWDCH_2           (0x04UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000004 */
#define ADC_CR1_AWDCH_3           (0x08UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000008 */
#define ADC_CR1_AWDCH_4           (0x10UL << ADC_CR1_AWDCH_Pos)                 /*!< 0x00000010 */
#define ADC_CR1_EOCIE_Pos         (5U)                                         
#define ADC_CR1_EOCIE_Msk         (0x1UL << ADC_CR1_EOCIE_Pos)                  /*!< 0x00000020 */
#define ADC_CR1_EOCIE             ADC_CR1_EOCIE_Msk                            /*!<Interrupt enable for EOC */
#define ADC_CR1_AWDIE_Pos         (6U)                                         
#define ADC_CR1_AWDIE_Msk         (0x1UL << ADC_CR1_AWDIE_Pos)                  /*!< 0x00000040 */
#define ADC_CR1_AWDIE             ADC_CR1_AWDIE_Msk                            /*!<AAnalog Watchdog interrupt enable */
#define ADC_CR1_JEOCIE_Pos        (7U)                                         
#define ADC_CR1_JEOCIE_Msk        (0x1UL << ADC_CR1_JEOCIE_Pos)                 /*!< 0x00000080 */
#define ADC_CR1_JEOCIE            ADC_CR1_JEOCIE_Msk                           /*!<Interrupt enable for injected channels */
#define ADC_CR1_SCAN_Pos          (8U)                                         
#define ADC_CR1_SCAN_Msk          (0x1UL << ADC_CR1_SCAN_Pos)                   /*!< 0x00000100 */
#define ADC_CR1_SCAN              ADC_CR1_SCAN_Msk                             /*!<Scan mode */
#define ADC_CR1_AWDSGL_Pos        (9U)                                         
#define ADC_CR1_AWDSGL_Msk        (0x1UL << ADC_CR1_AWDSGL_Pos)                 /*!< 0x00000200 */
#define ADC_CR1_AWDSGL            ADC_CR1_AWDSGL_Msk                           /*!<Enable the watchdog on a single channel in scan mode */
#define ADC_CR1_JAUTO_Pos         (10U)                                        
#define ADC_CR1_JAUTO_Msk         (0x1UL << ADC_CR1_JAUTO_Pos)                  /*!< 0x00000400 */
#define ADC_CR1_JAUTO             ADC_CR1_JAUTO_Msk                            /*!<Automatic injected group conversion */
#define ADC_CR1_DISCEN_Pos        (11U)                                        
#define ADC_CR1_DISCEN_Msk        (0x1UL << ADC_CR1_DISCEN_Pos)                 /*!< 0x00000800 */
#define ADC_CR1_DISCEN            ADC_CR1_DISCEN_Msk                           /*!<Discontinuous mode on regular channels */
#define ADC_CR1_JDISCEN_Pos       (12U)                                        
#define ADC_CR1_JDISCEN_Msk       (0x1UL << ADC_CR1_JDISCEN_Pos)                /*!< 0x00001000 */
#define ADC_CR1_JDISCEN           ADC_CR1_JDISCEN_Msk                          /*!<Discontinuous mode on injected channels */
#define ADC_CR1_DISCNUM_Pos       (13U)                                        
#define ADC_CR1_DISCNUM_Msk       (0x7UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x0000E000 */
#define ADC_CR1_DISCNUM           ADC_CR1_DISCNUM_Msk                          /*!<DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define ADC_CR1_DISCNUM_0         (0x1UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x00002000 */
#define ADC_CR1_DISCNUM_1         (0x2UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x00004000 */
#define ADC_CR1_DISCNUM_2         (0x4UL << ADC_CR1_DISCNUM_Pos)                /*!< 0x00008000 */
#define ADC_CR1_JAWDEN_Pos        (22U)                                        
#define ADC_CR1_JAWDEN_Msk        (0x1UL << ADC_CR1_JAWDEN_Pos)                 /*!< 0x00400000 */
#define ADC_CR1_JAWDEN            ADC_CR1_JAWDEN_Msk                           /*!<Analog watchdog enable on injected channels */
#define ADC_CR1_AWDEN_Pos         (23U)                                        
#define ADC_CR1_AWDEN_Msk         (0x1UL << ADC_CR1_AWDEN_Pos)                  /*!< 0x00800000 */
#define ADC_CR1_AWDEN             ADC_CR1_AWDEN_Msk                            /*!<Analog watchdog enable on regular channels */
#define ADC_CR1_RES_Pos           (24U)                                        
#define ADC_CR1_RES_Msk           (0x3UL << ADC_CR1_RES_Pos)                    /*!< 0x03000000 */
#define ADC_CR1_RES               ADC_CR1_RES_Msk                              /*!<RES[2:0] bits (Resolution) */
#define ADC_CR1_RES_0             (0x1UL << ADC_CR1_RES_Pos)                    /*!< 0x01000000 */
#define ADC_CR1_RES_1             (0x2UL << ADC_CR1_RES_Pos)                    /*!< 0x02000000 */
#define ADC_CR1_OVRIE_Pos         (26U)                                        
#define ADC_CR1_OVRIE_Msk         (0x1UL << ADC_CR1_OVRIE_Pos)                  /*!< 0x04000000 */
#define ADC_CR1_OVRIE             ADC_CR1_OVRIE_Msk                            /*!<overrun interrupt enable */
  
/*******************  Bit definition for ADC_CR2 register  ********************/
#define ADC_CR2_ADON_Pos          (0U)                                         
#define ADC_CR2_ADON_Msk          (0x1UL << ADC_CR2_ADON_Pos)                   /*!< 0x00000001 */
#define ADC_CR2_ADON              ADC_CR2_ADON_Msk                             /*!<A/D Converter ON / OFF */
#define ADC_CR2_CONT_Pos          (1U)                                         
#define ADC_CR2_CONT_Msk          (0x1UL << ADC_CR2_CONT_Pos)                   /*!< 0x00000002 */
#define ADC_CR2_CONT              ADC_CR2_CONT_Msk                             /*!<Continuous Conversion */
#define ADC_CR2_DMA_Pos           (8U)                                         
#define ADC_CR2_DMA_Msk           (0x1UL << ADC_CR2_DMA_Pos)                    /*!< 0x00000100 */
#define ADC_CR2_DMA               ADC_CR2_DMA_Msk                              /*!<Direct Memory access mode */
#define ADC_CR2_DDS_Pos           (9U)                                         
#define ADC_CR2_DDS_Msk           (0x1UL << ADC_CR2_DDS_Pos)                    /*!< 0x00000200 */
#define ADC_CR2_DDS               ADC_CR2_DDS_Msk                              /*!<DMA disable selection (Single ADC) */
#define ADC_CR2_EOCS_Pos          (10U)                                        
#define ADC_CR2_EOCS_Msk          (0x1UL << ADC_CR2_EOCS_Pos)                   /*!< 0x00000400 */
#define ADC_CR2_EOCS              ADC_CR2_EOCS_Msk                             /*!<End of conversion selection */
#define ADC_CR2_ALIGN_Pos         (11U)                                        
#define ADC_CR2_ALIGN_Msk         (0x1UL << ADC_CR2_ALIGN_Pos)                  /*!< 0x00000800 */
#define ADC_CR2_ALIGN             ADC_CR2_ALIGN_Msk                            /*!<Data Alignment */
#define ADC_CR2_JEXTSEL_Pos       (16U)                                        
#define ADC_CR2_JEXTSEL_Msk       (0xFUL << ADC_CR2_JEXTSEL_Pos)                /*!< 0x000F0000 */
#define ADC_CR2_JEXTSEL           ADC_CR2_JEXTSEL_Msk                          /*!<JEXTSEL[3:0] bits (External event select for injected group) */
#define ADC_CR2_JEXTSEL_0         (0x1UL << ADC_CR2_JEXTSEL_Pos)                /*!< 0x00010000 */
#define ADC_CR2_JEXTSEL_1         (0x2UL << ADC_CR2_JEXTSEL_Pos)                /*!< 0x00020000 */
#define ADC_CR2_JEXTSEL_2         (0x4UL << ADC_CR2_JEXTSEL_Pos)                /*!< 0x00040000 */
#define ADC_CR2_JEXTSEL_3         (0x8UL << ADC_CR2_JEXTSEL_Pos)                /*!< 0x00080000 */
#define ADC_CR2_JEXTEN_Pos        (20U)                                        
#define ADC_CR2_JEXTEN_Msk        (0x3UL << ADC_CR2_JEXTEN_Pos)                 /*!< 0x00300000 */
#define ADC_CR2_JEXTEN            ADC_CR2_JEXTEN_Msk                           /*!<JEXTEN[1:0] bits (External Trigger Conversion mode for injected channelsp) */
#define ADC_CR2_JEXTEN_0          (0x1UL << ADC_CR2_JEXTEN_Pos)                 /*!< 0x00100000 */
#define ADC_CR2_JEXTEN_1          (0x2UL << ADC_CR2_JEXTEN_Pos)                 /*!< 0x00200000 */
#define ADC_CR2_JSWSTART_Pos      (22U)                                        
#define ADC_CR2_JSWSTART_Msk      (0x1UL << ADC_CR2_JSWSTART_Pos)               /*!< 0x00400000 */
#define ADC_CR2_JSWSTART          ADC_CR2_JSWSTART_Msk                         /*!<Start Conversion of injected channels */
#define ADC_CR2_EXTSEL_Pos        (24U)                                        
#define ADC_CR2_EXTSEL_Msk        (0xFUL << ADC_CR2_EXTSEL_Pos)                 /*!< 0x0F000000 */
#define ADC_CR2_EXTSEL            ADC_CR2_EXTSEL_Msk                           /*!<EXTSEL[3:0] bits (External Event Select for regular group) */
#define ADC_CR2_EXTSEL_0          (0x1UL << ADC_CR2_EXTSEL_Pos)                 /*!< 0x01000000 */
#define ADC_CR2_EXTSEL_1          (0x2UL << ADC_CR2_EXTSEL_Pos)                 /*!< 0x02000000 */
#define ADC_CR2_EXTSEL_2          (0x4UL << ADC_CR2_EXTSEL_Pos)                 /*!< 0x04000000 */
#define ADC_CR2_EXTSEL_3          (0x8UL << ADC_CR2_EXTSEL_Pos)                 /*!< 0x08000000 */
#define ADC_CR2_EXTEN_Pos         (28U)                                        
#define ADC_CR2_EXTEN_Msk         (0x3UL << ADC_CR2_EXTEN_Pos)                  /*!< 0x30000000 */
#define ADC_CR2_EXTEN             ADC_CR2_EXTEN_Msk                            /*!<EXTEN[1:0] bits (External Trigger Conversion mode for regular channelsp) */
#define ADC_CR2_EXTEN_0           (0x1UL << ADC_CR2_EXTEN_Pos)                  /*!< 0x10000000 */
#define ADC_CR2_EXTEN_1           (0x2UL << ADC_CR2_EXTEN_Pos)                  /*!< 0x20000000 */
#define ADC_CR2_SWSTART_Pos       (30U)                                        
#define ADC_CR2_SWSTART_Msk       (0x1UL << ADC_CR2_SWSTART_Pos)                /*!< 0x40000000 */
#define ADC_CR2_SWSTART           ADC_CR2_SWSTART_Msk                          /*!<Start Conversion of regular channels */

